app/controllers/api/v1/items_controller.rb

INSERT INTO "items" ("name", "vendor", "quantity", "price", "description", "category", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    if @item.save

UPDATE "items" SET "name" = ?, "quantity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Kicking Horse"], ["quantity", 22], ["updated_at", "2022-05-17 19:23:40.747671"], ["id", 1]]
---
  def update
    if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_item
      # begin / rescue prevents ActiveRecord exception from halting (RSpec)
      begin
        @item = Item.find(params[:id])