app/controllers/api/v1/locations_controller.rb

INSERT INTO "locations" ("city", "state", "zip", "weather", "created_at", "updated_at", "country") VALUES (?, ?, ?, ?, ?, ?, ?)  [["city", "Montville"], ["state", "NJ"], ["zip", "07045"], ["weather", ""], ["created_at", "2022-05-17 19:23:42.532827"], ["updated_at", "2022-05-17 19:23:42.532827"], ["country", "US"]]
SELECT "items".* FROM "items"
---
  def create
    @location = Location.new(location_params)

    if @location.save
      item_ids = Item.all.map { |item| item.id }

UPDATE "locations" SET "city" = ?, "zip" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["city", "Sparta"], ["zip", "07871"], ["updated_at", "2022-05-17 19:23:42.980346"], ["id", 1]]
---
  def update
    if @location.update(location_params)

DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 1]]
---
  def destroy
    @location.destroy

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_location
      # begin / rescue prevents ActiveRecord exception from halting (RSpec)
      begin
        @location = Location.find(params[:id])