app/controllers/api/v1/weather_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_location
      @location = Location.find(params[:location_id])